#+TITLE: Montaje y pulido de niveles
#+AUTHOR: Carlos León
#+LANGUAGE: es
#+OPTIONS: toc:nil reveal_history:t timestamp:nil date:nil author:nil num:t reveal_single_file:t inline:nil
#+REVEAL_INIT_OPTIONS: slideNumber:true
#+REVEAL_EXTRA_CSS: css.css
#+REVEAL_THEME: beige


# Asumiendo que ya saben toda la teoría de diseño, les propondré 3 prácticas. Para cada una de las prácticas les haré un repaso de las mecánicas, les pondré algunos ejemplos, y les plantearé problemas concretos a resolver por parejas. Les daré todo implementado, pero si quieren modificar algo de BP, lo podemos hablar.

# Tras cada implementación, haremos “evaluación y pulido cruzados”, de forma que se “cambien” los diseños y los pulan aunque no sean suyos.

#     Nivel 2D lateral: un arcade simple con plataformas (a lo Mario Bros), obstáculos y demás
#         desarrollo de nivel lineal (principio-fin, yendo “a la derecha”)
#         pulido de velocidades, saltos y controles
#         distancias, saltos, llegar o no llegar, dificultad
#         bloqueo de retroceso por entorno (saltos para no poder ir atrás)
#     Dual-stick shooter (top-down, como Enter the Gungeon)
#         desarrollo de un mapa por habitaciones
#         pulido de velocidades y “feeling”
#         completado no lineal de nivel
#         layout estático de enemigos en nivel
#         configuración de layout dinámico de enemigos
#         armas y powerups
#         lógica llave-puerta
#     1ª persona (Half-Life)
#         Juego con campo de visión
#         Escenario cerrado, para jugar con la información
#         Enemigos “humanos”
#         Relación y despliegue de armas/tipos de enemigos
#         Localización de puntos de recuperación/salvado


* Introducción y objetivos

#+begin_src elisp :exports none
(setf lista-estudiantes '(2022 19))
(setf current-year (decoded-time-year (decode-time)))
(setf estudiantes (plist-get lista-estudiantes current-year))
(setf tiempo-por-grupo 5)
(setf miembros 2)
estudiantes
#+end_src

#+RESULTS:
: 19



